


/* Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6 */

/* int num;
Console.Write($"Ведите число: ");
int.TryParse(Console.ReadLine()!, out num);
if (num > 99 && num <= 999)
{
    int ThirdDigit = num%10;
    Console.WriteLine($"Третье число: {ThirdDigit}");
}
else
{
    Console.Write($"Третьей цифры нет");
}
//для цифр более 3-х значных не работает, пока не понял, как написать.
 */


 